base/DataProcessors/бит_УстановкаВиз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_УстановкаВиз</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектВизирования</Name>
					<Comment>Объект визирования</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ОбъектыВизирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

base/InformationRegisters/бит_ИсторияИзмененияВиз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ИсторияИзмененияВиз</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь, установивший визу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Решение</Name>
					<Comment>Решение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыРешенийСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКрайняя</Name>
					<Comment>Крайняя дата установки визы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ОбъектыВизирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Виза</Name>
					<Comment>Виза</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Визы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Comment>Идентификатор</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_ВидыСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыСтатусовОбъектов</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СостояниеОплаты</Name>
					<Comment>Состояние оплаты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_Визы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_Визы</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Произвольный код, используется для вывода в отчетах и печатных формах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид визы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыВиз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСвязи</Name>
					<Comment>Указывает, с физическим лицом или ЦФО связана виза</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыСвязиВиз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Литера</Name>
					<Comment>Литера, связанная с визой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСвязи</Name>
					<Comment>Объект, с которым связана виза. Физическое лицо или ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПечати</Name>
					<Comment>Режим печати визы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимПечатиВиз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНаУстановку</Name>
					<Comment>Время на установку визы в минутах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/DataProcessors/бит_УстановкаВиз/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
		
// Выводит историю визирования.
// 
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - Табличный документ в который будет выведена история.
//  ОбъектВизирования - ДокументСсылка - Объект визирования.
// 
Процедура ВывестиИсториюВизирования(ТабличныйДокумент, ОбъектВизирования)  Экспорт
	
	ТабличныйДокумент.Очистить();
	
	Макет = Обработки.бит_УстановкаВиз.ПолучитьМакет("ИсторияВизирования");
	
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблВиза      = Макет.ПолучитьОбласть("Виза");
	ОблШапкаТаблицы		   = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОблСообщениеЗаголовок1 = Макет.ПолучитьОбласть("СообщениеЗаголовокПервое");
	ОблСообщениеЗаголовок  = Макет.ПолучитьОбласть("СообщениеЗаголовок");
	ОблСообщениеТекст      = Макет.ПолучитьОбласть("СообщениеТекст");
	ОблСообщениеТекст2     = Макет.ПолучитьОбласть("СообщениеТекст2");
	ОблПоследняя           = Макет.ПолучитьОбласть("Последняя");	
	
	ЦветаВидовСтрок = Новый Структура;
	ЦветаВидовСтрок.Вставить("История"	, ЦветаСтиля.бит_ФонПодписьВерна);
	ЦветаВидовСтрок.Вставить("Сообщение", ЦветаСтиля.ИзмененноеЗначениеРеквизитаФон);
	ЦветаВидовСтрок.Вставить("Задача"	, ЦветаСтиля.ФонУправляющегоПоля);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектВизирования", ОбъектВизирования);
	Запрос.УстановитьПараметр("ТекущаяДата"		 , ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УстановленныеВизы.Виза КАК Виза,
	|	УстановленныеВизы.Решение КАК Решение
	|ИЗ
	|	РегистрСведений.бит_УстановленныеВизы КАК УстановленныеВизы
	|ГДЕ
	|	УстановленныеВизы.Объект = &ОбъектВизирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияИзмененияСтатусов.Период КАК Период,
	|	ИсторияИзмененияСтатусов.Объект КАК Объект,
	|	ИсторияИзмененияСтатусов.ВидСтатуса КАК ВидСтатуса,
	|	ИсторияИзмененияСтатусов.Статус КАК Статус,
	|	ИсторияИзмененияСтатусов.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ ВТИсторияИзмененияСтатусов
	|ИЗ
	|	РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов КАК ИсторияИзмененияСтатусов
	|ГДЕ
	|	ИсторияИзмененияСтатусов.Объект = &ОбъектВизирования
	|	И ИсторияИзмененияСтатусов.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.бит_ВидыСтатусовОбъектов.Статус)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияИзмененияВиз.Период КАК Период,
	|	""История"" КАК Вид,
	|	ИсторияИзмененияВиз.Объект КАК Объект,
	|	ИсторияИзмененияВиз.Виза КАК Виза,
	|	ИсторияИзмененияВиз.ИД КАК ИД,
	|	ИсторияИзмененияВиз.Пользователь КАК Пользователь,
	|	ИсторияИзмененияВиз.Комментарий КАК Комментарий,
	|	ИсторияИзмененияВиз.Решение КАК Решение,
	|	ИсторияИзмененияВиз.ДатаКрайняя КАК ДатаКрайняя,
	|	NULL КАК РезультатВыполнения,
	|	NULL КАК Состояние,
	|	ВЫБОР
	|		КОГДА ИсторияИзмененияВиз.ДатаКрайняя <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫБОР
	|					КОГДА ИсторияИзмененияВиз.Период = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВЫБОР
	|								КОГДА ИсторияИзмененияВиз.ДатаКрайняя < &ТекущаяДата
	|									ТОГДА ИСТИНА
	|								ИНАЧЕ ЛОЖЬ
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ИсторияИзмененияВиз.ДатаКрайняя < ИсторияИзмененияВиз.Период
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Просрочено
	|ПОМЕСТИТЬ ВТИсторияИзмененияВиз
	|ИЗ
	|	РегистрСведений.бит_ИсторияИзмененияВиз КАК ИсторияИзмененияВиз
	|ГДЕ
	|	ИсторияИзмененияВиз.Объект = &ОбъектВизирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИсторияИзмененияВиз.Период КАК Период,
	|	NULL КАК Статус,
	|	""ИзменениеВизы"" КАК ВидИзменения,
	|	ВТИсторияИзмененияВиз.Виза КАК Виза
	|ИЗ
	|	ВТИсторияИзмененияВиз КАК ВТИсторияИзмененияВиз
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТИсторияИзмененияСтатусов.Период,
	|	ВТИсторияИзмененияСтатусов.Статус,
	|	""ИзменениеСтатуса"",
	|	NULL
	|ИЗ
	|	ВТИсторияИзмененияСтатусов КАК ВТИсторияИзмененияСтатусов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИсторияИзмененияВиз.Период КАК Период,
	|	ВТИсторияИзмененияВиз.Вид КАК Вид,
	|	ВТИсторияИзмененияВиз.Объект КАК Объект,
	|	ВТИсторияИзмененияВиз.Виза КАК Виза,
	|	ВТИсторияИзмененияВиз.ИД КАК ИД,
	|	ВТИсторияИзмененияВиз.Пользователь КАК Пользователь,
	|	ВТИсторияИзмененияВиз.Комментарий КАК Комментарий,
	|	ВТИсторияИзмененияВиз.Решение КАК Решение,
	|	ВТИсторияИзмененияВиз.ДатаКрайняя КАК ДатаКрайняя,
	|	ВТИсторияИзмененияВиз.РезультатВыполнения КАК РезультатВыполнения,
	|	ВТИсторияИзмененияВиз.Состояние КАК Состояние,
	|	ВТИсторияИзмененияВиз.Просрочено КАК Просрочено,
	|	NULL КАК Статус,
	|	NULL КАК Ссылка,
	|	NULL КАК Номер,
	|	NULL КАК Наименование
	|ИЗ
	|	ВТИсторияИзмененияВиз КАК ВТИсторияИзмененияВиз
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СообщенияПользователей.Период,
	|	""Сообщение"",
	|	СообщенияПользователей.Объект,
	|	СообщенияПользователей.Виза,
	|	СообщенияПользователей.ИД,
	|	СообщенияПользователей.Пользователь,
	|	ВЫРАЗИТЬ(СообщенияПользователей.ТекстСообщения КАК СТРОКА(1000)),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.бит_СообщенияПользователей КАК СообщенияПользователей
	|ГДЕ
	|	СообщенияПользователей.Объект = &ОбъектВизирования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Задача.Дата,
	|	""Задача"",
	|	Задача.Предмет,
	|	Задача.Виза,
	|	NULL,
	|	Задача.Автор,
	|	ВЫРАЗИТЬ(Задача.Описание КАК СТРОКА(1000)),
	|	NULL,
	|	NULL,
	|	ВЫРАЗИТЬ(Задача.РезультатВыполнения КАК СТРОКА(1000)),
	|	Задача.Состояние,
	|	ВЫБОР
	|		КОГДА Задача.СрокИсполнения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫБОР
	|					КОГДА Задача.ДатаОкончанияИсполнения <> ДАТАВРЕМЯ(1, 1, 1)
	|							И Задача.ДатаОкончанияИсполнения > Задача.СрокИсполнения
	|						ТОГДА ИСТИНА
	|					КОГДА Задача.ДатаОкончанияИсполнения = ДАТАВРЕМЯ(1, 1, 1)
	|							И &ТекущаяДата > Задача.СрокИсполнения
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Задача.Состояние,
	|	Задача.Ссылка,
	|	Задача.Номер,
	|	Задача.Наименование
	|ИЗ
	|	Задача.бит_Задача КАК Задача
	|ГДЕ
	|	Задача.Предмет = &ОбъектВизирования
	|	И НЕ Задача.Виза = ЗНАЧЕНИЕ(Справочник.бит_Визы.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|ИТОГИ ПО
	|	Виза
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();				
	
	ОблЗаголовок.Параметры.Документ = ОбъектВизирования;
	ТабличныйДокумент.Вывести(ОблЗаголовок);
	
	ТабличныйДокумент.Вывести(ОблШапкаТаблицы);
	
	// Кешируем текущие решения для вывода.
	Решения   = Новый Соответствие;
	Результат = МассивРезультатов[0];
	Выборка   = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл		
		Решения.Вставить(Выборка.Виза, Выборка.Решение);		
	КонецЦикла; 
	
	// Вывод истории и сообщений.
	Результат = МассивРезультатов[4];
	Если Результат.Пустой() Тогда		
		Возврат;		
	КонецЕсли; 
	
	// Таблица хронологии изменения статусов и виз.
	РезультатХронология = МассивРезультатов[3];
	ТабХронология = РезультатХронология.Выгрузить();
	
	ВыборкаВиза = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	
	Пока ВыборкаВиза.Следующий() Цикл
		
		Расшифровка = Новый Структура("Виза, ИД", ВыборкаВиза.Виза,"");
		
		Выборка = ВыборкаВиза.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		АктуальноеРешение = Решения[ВыборкаВиза.Виза];
		
		ОблВиза.Параметры.Виза = Строка(ВыборкаВиза.Виза)+?(ЗначениеЗаполнено(АктуальноеРешение), " - "+Строка(АктуальноеРешение),"");
		ОблВиза.Параметры.р    = Расшифровка;
		ТабличныйДокумент.Вывести(ОблВиза, 0);
		
		инд = 1;
		Пока Выборка.Следующий() Цикл
			
			НомерПервойСтроки = ТабличныйДокумент.ВысотаТаблицы;
			
			Расшифровка = Новый Структура("Виза, ИД", ВыборкаВиза.Виза, Выборка.ИД);			
			
			ОблМакета = ?(Выборка.Вид = "Сообщение", ОблСообщениеЗаголовок, ОблСообщениеЗаголовок1);
			ОблМакета.Параметры.Заполнить(Выборка);
			
			Если Выборка.Вид = "История" Тогда
				
				СтатусВизы = ПолучитьСтатусДляВизы(ТабХронология, Выборка);
				ОблМакета.Параметры.Статус = СтатусВизы;
				
				ОблМакета.Параметры.Решение = ?(ЗначениеЗаполнено(Выборка.Решение), Выборка.Решение,  НСтр("ru='Решение не принято';en='No decision'"));
				
				ОблМакета.Параметры.р = Расшифровка;
				ТабличныйДокумент.Вывести(ОблМакета, 1);
				
				Если ЗначениеЗаполнено(Выборка.Комментарий) Тогда
					
					ТекстКомментарий = НСтр("ru='Комментарий: %1';en='Comment: %1'");
					ОблСообщениеТекст.Параметры.Комментарий = СтрШаблон(ТекстКомментарий, Выборка.Комментарий);
					ОблСообщениеТекст.Параметры.р = Расшифровка;
					// Установка имени области для последующего поиска и позиционирования на сообщении.
					ОбластьЯчейки = ОблСообщениеТекст.Область(1,2,1,2);
					ОбластьЯчейки.Имя = Строка(Выборка.ИД);
					ТабличныйДокумент.Вывести(ОблСообщениеТекст, 1);				
					
				КонецЕсли;
				
			ИначеЕсли Выборка.Вид = "Задача" Тогда
				
				ОблСообщениеТекст2.Параметры.Заполнить(Выборка);
				
				ТекстКомментарий = НСтр("ru='Создана задача №%1 от %2';en='Task is created from №%1 from %2'");
				Комментарий = СтрШаблон(ТекстКомментарий, Выборка.Номер, Выборка.Период);
				ОблСообщениеТекст2.Параметры.Комментарий = Комментарий;
				ОблСообщениеТекст2.Параметры.р = Выборка.Ссылка;
				ТабличныйДокумент.Вывести(ОблСообщениеТекст2, 1);
				
				ТекстКомментарий = НСтр("ru='Автор: %1';en='Author: %1'");
				Комментарий = СтрШаблон(ТекстКомментарий, Выборка.Пользователь);
				ОблСообщениеТекст.Параметры.Комментарий = Комментарий;
				ТабличныйДокумент.Вывести(ОблСообщениеТекст, 2);
				
				ТекстКомментарий = НСтр("ru='Описание задачи: %1';en='Task description: 1%'");
				Комментарий = СтрШаблон(ТекстКомментарий, ?(ПустаяСтрока(Выборка.Комментарий), Выборка.Наименование, Выборка.Комментарий));
				ОблСообщениеТекст.Параметры.Комментарий = Комментарий;
				ТабличныйДокумент.Вывести(ОблСообщениеТекст, 2);
				
				ТекстКомментарий = НСтр("ru='Результат выполнения задачи: %1';en='The result of the tasks: %1'");
				Комментарий = СтрШаблон(ТекстКомментарий, Выборка.РезультатВыполнения);
				ОблСообщениеТекст.Параметры.Комментарий = Комментарий;
				ТабличныйДокумент.Вывести(ОблСообщениеТекст, 2);
				
			Иначе
				
				ОблМакета.Параметры.р = Расшифровка;
				ТабличныйДокумент.Вывести(ОблМакета, 1);
				
				Если ЗначениеЗаполнено(Выборка.Комментарий) Тогда
					
					ТекстКомментарий = НСтр("ru='Сообщение: %1';en='Message: %1'");
					Комментарий = СтрШаблон(ТекстКомментарий, Выборка.Комментарий);
					ОблСообщениеТекст.Параметры.Комментарий = Комментарий;
					ОблСообщениеТекст.Параметры.р = Расшифровка;
					// Установка имени области для последующего поиска и позиционирования на сообщении.
					ОбластьЯчейки = ОблСообщениеТекст.Область(1,2,1,2);
					ОбластьЯчейки.Имя = Строка(Выборка.ИД);
					ТабличныйДокумент.Вывести(ОблСообщениеТекст, 1);				
					
				КонецЕсли;
			КонецЕсли; 
			
			// Изменим цвет фона
			Область = ТабличныйДокумент.Область(НомерПервойСтроки+1,2,ТабличныйДокумент.ВысотаТаблицы,ТабличныйДокумент.ШиринаТаблицы);
			Область.ЦветФона = ЦветаВидовСтрок[Выборка.Вид];
			
			инд = инд +1;	
		КонецЦикла; // Выборка
		
	КонецЦикла; // ВыборкаВиза
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	ТабличныйДокумент.Вывести(ОблПоследняя);
	
	ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(1);
	ТабличныйДокумент.АвтоМасштаб = Истина;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция получает статус объекта после установки текущей визы.
// 
// Параметры:
// 	Таб - ТаблицаЗначений - таблица содержит общую хронологию изменений статусов и виз.
// 	Выборка - ВыборкаИзРезультатаЗапроса - данные по текущей визе.
// 
// Возвращаемое значение:
// 	Статус. 
// 
Функция ПолучитьСтатусДляВизы(Таб, Выборка)
	
	Статус = Неопределено;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Виза"	 , Выборка.Виза);
	СтруктураОтбора.Вставить("Период", Выборка.Период);
	
	НайденныеСтроки = Таб.НайтиСтроки(СтруктураОтбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Статус;
	КонецЕсли;
	
	НомСтроки = Таб.Индекс(НайденныеСтроки[0]);
	
	// По хронологии событий сначала происходит изменение визы и только потом статуса
	// 	если установка визы повлекла за собой изменение статуса, то этот статус надо искать следующим по оси времени.
	НомСледСтроки = НомСтроки+1; 
	Если НомСледСтроки <= Таб.Количество()-1
		И Таб[НомСледСтроки].ВидИзменения = "ИзменениеСтатуса" Тогда
		Статус = Таб[НомСледСтроки].Статус;
	КонецЕсли;
	
	// Установка визы не изменила статус объекта, следовательно статус надо искать в "прошлом".
	Если Статус = Неопределено Тогда
		Для Ном = 0 По НомСтроки Цикл
			Инд = НомСтроки-Ном;
			
			Если Таб[Инд].ВидИзменения = "ИзменениеСтатуса" Тогда
				Статус = Таб[Инд].Статус;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
